pmo-dataset/variations/mermaid_with_ids/14.mmd
graph LR
	classDef endEvent stroke-width:3px
	Task_1["Implement plan"]
	Task_2["Approve final budget"]
	Task_3["Provide feedback"]
	Task_4["Distribute budget"]
	Task_5["Outline objectives"]
	Task_6["Draft plan"]
	Task_7["Documented and\napprove adjustment"]
	Task_8["Review budget\nfeasibility"]
	Task_9["Adjust Plan"]
	Task_10["Conduct strategic\nalignment meeting"]
	StartNoneEvent_1(("start"))
	EndNoneEvent_1(("end")):::endEvent
	ExclusiveGateway_1{"X"}
	ExclusiveGateway_2{"X"}

	Task_10 --> ExclusiveGateway_2
	ExclusiveGateway_2 --> Task_8
	Task_7 --> ExclusiveGateway_2
	Task_5 --> Task_6
	Task_1 --> EndNoneEvent_1
	Task_3 --> ExclusiveGateway_1
	Task_4 --> Task_1
	Task_9 --> Task_7
	ExclusiveGateway_1 --> Task_2
	Task_8 --> Task_3
	ExclusiveGateway_1 --> Task_9
	Task_2 --> Task_4
	Task_6 --> Task_10
	StartNoneEvent_1 --> Task_5
